validation/REDIM-MAD-2D/coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        101325;
        lInf            0.5;
        value           uniform 101325;
    }
    edge
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        101325;
        lInf            0.5;
        value           uniform 101325;
    }
    inlet3
    {
        type            zeroGradient;
    }
    inlet2
    {
        type            zeroGradient;
    }
    inlet1
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
