validation/REDIM-MAD-2D/coarse/0/theta2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      theta2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    edge
    {
        type            zeroGradient;
    }
    inlet3
    {
        type            fixedValue;
	value           uniform 100;
    }
    inlet2
    {
        type            fixedValue;
	value           uniform 100;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform 100;
    }
    wall
    {
        type            updateWallTheta2;
        value           uniform 100;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
