validation/REDIM-MAD-2D/coarse/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  REDIMModel;

active  true;

nDims   2;

REDIMModelCoeffs
{
}

species
20
(
N2                       
H2                       
H                        
O2                       
O                        
H2O                      
OH                       
H2O2                     
HO2                      
CO                       
CO2                      
CH4                      
CH3                      
CH2(S)                   
CH3O                     
CH2O                     
HCO                      
C2H6                     
CH3OCH3                  
CH3OCH2
);

gridResolution coarse;

tableForm noflip;

nSpec 20;

// ************************************************************************* //
